In [1]:
import pandas as pd

In [75]:
# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Occupation': ['Engineer', 'Doctor', 'Artist'],
    'Code': ['A123', 'B456', 'C789'],
    'Comment': [' Nice Person ', 'Excellent Worker', 'Very Creative']
}
df = pd.DataFrame(data)

# Display the DataFrame
print("Original DataFrame:")
df

Original DataFrame:

      Name Occupation  Code           Comment
0    Alice   Engineer  A123      Nice Person
1      Bob     Doctor  B456  Excellent Worker
2  Charlie     Artist  C789     Very Creative

### 1] Upper

In [78]:
df['Occupation_upper']=df['Occupation'].str.upper()

In [79]:
df

      Name Occupation  Code           Comment Occupation_upper
0    Alice   Engineer  A123      Nice Person          ENGINEER
1      Bob     Doctor  B456  Excellent Worker           DOCTOR
2  Charlie     Artist  C789     Very Creative           ARTIST

### 2] Lower

In [80]:
df['Occupation_lower']=df['Occupation'].str.lower()

In [81]:
df

,Name,Occupation,Code,Comment,Occupation_upper,Occupation_lower
0,Alice,Engineer,A123,Nice Person,ENGINEER,engineer
1,Bob,Doctor,B456,Excellent Worker,DOCTOR,doctor
2,Charlie,Artist,C789,Very Creative,ARTIST,artist

### 3] find

To find position of substring

In [82]:
df['l-position']=df['Name'].str.find('l')

In [83]:
df

,Name,Occupation,Code,Comment,Occupation_upper,Occupation_lower,l-position
0,Alice,Engineer,A123,Nice Person,ENGINEER,engineer,1
1,Bob,Doctor,B456,Excellent Worker,DOCTOR,doctor,-1
2,Charlie,Artist,C789,Very Creative,ARTIST,artist,4

### 4] rfind

In [84]:
df['l-at-right-position']=df['Name'].str.rfind('l')

In [85]:
df

,Name,Occupation,Code,Comment,Occupation_upper,Occupation_lower,l-position,l-at-right-position
0,Alice,Engineer,A123,Nice Person,ENGINEER,engineer,1,1
1,Bob,Doctor,B456,Excellent Worker,DOCTOR,doctor,-1,-1
2,Charlie,Artist,C789,Very Creative,ARTIST,artist,4,4

### 5] findall

In [86]:
df['comment_findall']=df['Comment'].str.findall('e')

In [87]:
df

,Name,Occupation,Code,Comment,Occupation_upper,Occupation_lower,l-position,l-at-right-position,comment_findall
0,Alice,Engineer,A123,Nice Person,ENGINEER,engineer,1,1,"[e, e]"
1,Bob,Doctor,B456,Excellent Worker,DOCTOR,doctor,-1,-1,"[e, e, e]"
2,Charlie,Artist,C789,Very Creative,ARTIST,artist,4,4,"[e, e, e]"

### 6] isalpha

Check if all characters in the 'Comment' column are alphabetic.

In [88]:
df['is_aplhabetic_comment']=df['Comment'].str.isalpha()

In [89]:
df

,Name,Occupation,Code,Comment,Occupation_upper,Occupation_lower,l-position,l-at-right-position,comment_findall,is_aplhabetic_comment
0,Alice,Engineer,A123,Nice Person,ENGINEER,engineer,1,1,"[e, e]",False
1,Bob,Doctor,B456,Excellent Worker,DOCTOR,doctor,-1,-1,"[e, e, e]",False
2,Charlie,Artist,C789,Very Creative,ARTIST,artist,4,4,"[e, e, e]",False

In [90]:
df['is_aplhabetic']=df['Occupation'].str.isalpha()
df

,Name,Occupation,Code,Comment,Occupation_upper,Occupation_lower,l-position,l-at-right-position,comment_findall,is_aplhabetic_comment,is_aplhabetic
0,Alice,Engineer,A123,Nice Person,ENGINEER,engineer,1,1,"[e, e]",False,True
1,Bob,Doctor,B456,Excellent Worker,DOCTOR,doctor,-1,-1,"[e, e, e]",False,True
2,Charlie,Artist,C789,Very Creative,ARTIST,artist,4,4,"[e, e, e]",False,True

### 7] isdigit

Check if all characters in the 'Code' column are digits.

In [91]:
df['is_digit_code']=df['Code'].str.isdigit()

In [92]:
df

,Name,Occupation,Code,Comment,Occupation_upper,Occupation_lower,l-position,l-at-right-position,comment_findall,is_aplhabetic_comment,is_aplhabetic,is_digit_code
0,Alice,Engineer,A123,Nice Person,ENGINEER,engineer,1,1,"[e, e]",False,True,False
1,Bob,Doctor,B456,Excellent Worker,DOCTOR,doctor,-1,-1,"[e, e, e]",False,True,False
2,Charlie,Artist,C789,Very Creative,ARTIST,artist,4,4,"[e, e, e]",False,True,False

### 8] isdecimal

Check if all characters in the 'Code' column are decimal.

In [93]:
df['is_decimal_name']=df['Name'].str.isdecimal()

In [94]:
df

,Name,Occupation,Code,Comment,Occupation_upper,Occupation_lower,l-position,l-at-right-position,comment_findall,is_aplhabetic_comment,is_aplhabetic,is_digit_code,is_decimal_name
0,Alice,Engineer,A123,Nice Person,ENGINEER,engineer,1,1,"[e, e]",False,True,False,False
1,Bob,Doctor,B456,Excellent Worker,DOCTOR,doctor,-1,-1,"[e, e, e]",False,True,False,False
2,Charlie,Artist,C789,Very Creative,ARTIST,artist,4,4,"[e, e, e]",False,True,False,False

### 9] rstrip, lstrip, strip - removing white spaces

In [95]:
df['right_whitespace']=['hi  ', 'bi  ', 'cii  ']
df['left_whitespace']=['  ko','  po','  so']
df['both_end_whitespace']=['  ji  ','  joo  ', 'boo ']

In [96]:
df

,Name,Occupation,Code,Comment,Occupation_upper,Occupation_lower,l-position,l-at-right-position,comment_findall,is_aplhabetic_comment,is_aplhabetic,is_digit_code,is_decimal_name,right_whitespace,left_whitespace,both_end_whitespace
0,Alice,Engineer,A123,Nice Person,ENGINEER,engineer,1,1,"[e, e]",False,True,False,False,hi,ko,ji
1,Bob,Doctor,B456,Excellent Worker,DOCTOR,doctor,-1,-1,"[e, e, e]",False,True,False,False,bi,po,joo
2,Charlie,Artist,C789,Very Creative,ARTIST,artist,4,4,"[e, e, e]",False,True,False,False,cii,so,boo

In [97]:
df['rm_r_ws']=df['right_whitespace'].str.rstrip()

In [98]:
df['rm_l_ws']=df['left_whitespace'].str.lstrip()

In [99]:
df['rm_ws']=df['both_end_whitespace'].str.strip()

In [100]:
df.columns

Index(['Name', 'Occupation', 'Code', 'Comment', 'Occupation_upper',
       'Occupation_lower', 'l-position', 'l-at-right-position',
       'comment_findall', 'is_aplhabetic_comment', 'is_aplhabetic',
       'is_digit_code', 'is_decimal_name', 'right_whitespace',
       'left_whitespace', 'both_end_whitespace', 'rm_r_ws', 'rm_l_ws',
       'rm_ws'],
      dtype='object')

In [101]:
df[['right_whitespace',
       'left_whitespace', 'both_end_whitespace', 'rm_r_ws', 'rm_l_ws',
       'rm_ws']]

  right_whitespace left_whitespace both_end_whitespace rm_r_ws rm_l_ws rm_ws
0             hi                ko                ji        hi      ko    ji
1             bi                po               joo        bi      po   joo
2            cii                so                boo      cii      so   boo

### 10] split

In [102]:
df['split']=df['Code'].str.split(r'(\d+)')
df['split']

0    [A, 123, ]
1    [B, 456, ]
2    [C, 789, ]
Name: split, dtype: object

Note:

    '\d+' takes only text eg: '12AD' --> ['','AD']
    '(\d+)' both text and number eg: '12AD' --> ['','12','AD']

### 11] Join

In [103]:
df['Joining']=df['split'].str.join('-')

In [104]:
df[['split','Joining']]

        split Joining
0  [A, 123, ]  A-123-
1  [B, 456, ]  B-456-
2  [C, 789, ]  C-789-

### 12] cat - Concatenation

In [105]:
df['Name_Occupation']=df['Name'].str.cat(df['Occupation'],sep='_')

In [106]:
df['Name_Occupation']

0    Alice_Engineer
1        Bob_Doctor
2    Charlie_Artist
Name: Name_Occupation, dtype: object

### 13] partition - split based on first occurance

In [107]:
df['Joining'].str.partition('-')

   0  1     2
0  A  -  123-
1  B  -  456-
2  C  -  789-

### 14] rpartition - split based on first occurance at right side

In [108]:
df['Joining'].str.rpartition('-')

       0  1 2
0  A-123  -
1  B-456  -
2  C-789  -

### 15] Title- capitalize the each word first letter

In [109]:
df['Occupation_lower_capitalize']=df['Occupation_lower'].str.title()

In [111]:
df['Occupation_lower_capitalize']

0    Engineer
1      Doctor
2      Artist
Name: Occupation_lower_capitalize, dtype: object

In [112]:
df['Occupation_lower_capitalize'].strswapcase()

AttributeError: 'Series' object has no attribute 'swapcase'